Autodesk.Revit.DB.ModelPathUtils.HashDocumentPathName(Autodesk.Revit.DB.Document)
Hash of document's path name by removing private information
Once hashed it can be used for logging. E.g send to analytics
aDoc:
The document whose path name is to be hashed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ModelPathUtils.ConvertCloudGUIDsToCloudPath(System.String,System.Guid,System.Guid)
Converts a pair of cloud project and model GUIDs to a valid cloud path.
region:
The region of the BIM 360 account and project which contains this model.
Please see the reference values, like Autodesk.Revit.DB.ModelPathUtils.CloudRegionUS and Autodesk.Revit.DB.ModelPathUtils.CloudRegionEMEA,
and the new regions from release note.
projectId:
The GUID of the cloud project which contains the model.
modelId:
The GUID of the Revit cloud model.
Returns:
The cloud model path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
The cloud model is missing.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The central server could not be reached.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
You must sign in to Autodesk 360 in order to complete action.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You are unauthorized to access this resource.
Since:
2021

Autodesk.Revit.DB.ModelPathUtils.ConvertCloudGUIDsToCloudPath(System.Guid,System.Guid)
Converts a pair of cloud project and model GUIDs to a valid cloud path in BIM 360 US region.
projectId:
The GUID of the cloud project which contains the model.
modelId:
The GUID of the Revit cloud model.
Returns:
The cloud model path.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The cloud model is missing.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The central server could not be reached.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
You must sign in to Autodesk 360 in order to complete action.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You are unauthorized to access this resource.
Since:
2019